import os


def print_banner():
    os.system('cls' if os.name == 'nt' else 'clear')  # 根据操作系统选择清屏命令
    """打印工具的横幅信息"""
    banner = """
 _______  _______  _______  _______  _______  _______  _______
(  ____ $\\/(      (  ____ \\(  ___  )(       )(  ____ $$(  ____ \\
| (    \\/| () () | (    \\/| (   ) || () () || (    \\/| (    \\/
| (__    | || || | (__    | (___) || || || || (__    | (_____
|  __)   | |(_)| |  __)   |  ___  || |(_)| ||  __)   (_____  \\
| (      | |   | | (      | (   ) || |   | || (            ) |
| (____/\\| )   ( | (____/\\| )   ( || )   ( || (____/\\/\\____) |
(_______/|/     \\(_______/|/     \\||/     \\|(_______/\\_______)

    """
    print(banner)
    print("工具名称: shuangmians-DownReel-tool")
    print("作者名称: 双面")
    print("版本信息: v1.0.1")
    print("功能描述: 高效影视资源抓取与下载工具")
    print("=" * 80)
